{
  "mermaid_syntax_lessons": [
    {
      "rule": "Quote all edge labels, task names, and section headers containing special characters",
      "details": "Special characters include parentheses (), colons :, pipes |, slashes /, question marks ?, commas ,, and spaces (optional but safer).",
      "incorrect_example": "Mutator -->|Request Tier 2 Eval (Adaptive Sampling)| FormalSimRunner",
      "correct_example": "Mutator -->|\"Request Tier 2 Eval (Adaptive Sampling)\"| FormalSimRunner"
    },
    {
      "rule": "Quote all Gantt chart section headers with colons, parentheses, or special characters",
      "details": "Unquoted section headers with colons or parentheses can break parsing.",
      "incorrect_example": "section Phase 1: Core Infrastructure & Basic Loop (9 Weeks)",
      "correct_example": "section \"Phase 1: Core Infrastructure & Basic Loop (9 Weeks)\""
    },
    {
      "rule": "Remove all Markdown formatting inside Mermaid code blocks",
      "details": "Do not use **bold**, _italic_, or other Markdown syntax inside Mermaid diagrams.",
      "incorrect_example": "**Define SEU Model Ingestion Strategy** :p2t1, after p1t8, 5d",
      "correct_example": "\"Define SEU Model Ingestion Strategy\" :p2t1, after p1t8, 5d"
    },
    {
      "rule": "Remove inline comments inside Mermaid code blocks",
      "details": "Inline comments like # comment will break Mermaid parsing.",
      "incorrect_example": "SeniorCoder -->|Needs Context| Boomerang # Explicit Context Req.",
      "correct_example": "SeniorCoder -->|\"Needs Context\"| Boomerang"
    },
    {
      "rule": "Ensure Mermaid diagrams are inside properly labeled code blocks",
      "details": "Use ```mermaid fenced code blocks, not ```markdown or ```text.",
      "incorrect_example": "```markdown ... ```",
      "correct_example": "```mermaid ... ```"
    },
    {
      "rule": "Avoid nested code blocks inside Mermaid diagrams",
      "details": "Nested code blocks can break rendering."
    },
    {
      "rule": "Prefer quoting labels with spaces or punctuation even if not strictly required",
      "details": "This improves robustness and avoids subtle parse errors."
    }
  ],
  "summary": "Following these rules ensures Mermaid diagrams render correctly across tools and avoid common parse errors.",
  "planner_lessons": [
    {
      "lesson": "Parallelize multi-role reviews during initial documentation audits.",
      "details": "When delegating an audit task, instruct Boomerang Mode to initiate Librarian, Designer, Coder, and Hacker reviews simultaneously. This accelerates the audit phase and allows for a faster compilation of prioritized issues once all reviews conclude."
    },
    {
      "lesson": "Investigate discrepancies between Boomerang task completion reports and Git status.",
      "details": "Observed 'nothing to commit' after Boomerang reported successful file modifications for Task 2.1. This indicates a potential issue with file persistence, premature reporting, or incorrect commit attribution. Monitor and investigate further if this pattern repeats."
    },
    {
      "title": "Coordinated Multi-Role Security Documentation Update",
      "context": "Task 6.2 - Addressing Final Security Documentation Gaps",
      "insight": "A structured workflow—starting with Librarian synthesis, followed by Coder technical drafting, Hacker validation, and Librarian clarity refinement—ensures security documentation is both technically robust and accessible. This sequence minimizes gaps and miscommunication, especially when explicit prior review details are unavailable.",
      "date": "2025-04-08"
    },
    {
      "title": "Integrate Operational Security Checks Earlier in Documentation Reviews",
      "context": "Task 6.1 - Final Review Identified Critical Security Gaps",
      "insight": "Relying solely on the final review (Phase 6) to catch critical operational security gaps (access control, key management, audit trails) is risky. Future plans should incorporate specific Hacker checks for these operational aspects earlier, perhaps during Phase 4 (Technical & Security Review), to allow more time for remediation and prevent late-stage blockers.",
      "date": "2025-04-08"
    }
  ]
}